app/Controllers/Admin/UsuarioController.php

SELECT *
FROM `usuarios`
ORDER BY `id` DESC
 LIMIT 50
---
    public function index()
    {
        $usuarios = $this->usuario->orderBy('id', 'desc')->findAll(50);